<?php
// include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile   = "Name here";							//رقم الجوال (إسم المستخدم) في موبايلي
$password = "password here";							//كلمة المرور في موبايلي

$sender = "businesshamad.sa";					//اسم المرسل الذي سيظهر عند ارسال الرساله، ويتم تشفيره إلى  بشكل تلقائي إلى نوع التشفير (urlencode)

// $numbers = "966533124197";							//يجب كتابة الرقم بالصيغة الدولية مثل 96650555555 وعند الإرسال إلى أكثر من رقم يجب وضع الفاصلة (,) وهي التي عند حرف الواو بين كل رقمين 
// $numbers = "97333166353";							//يجب كتابة الرقم بالصيغة الدولية مثل 96650555555 وعند الإرسال إلى أكثر من رقم يجب وضع الفاصلة (,) وهي التي عند حرف الواو بين كل رقمين 
// $numbers = "201021367387";							//يجب كتابة الرقم بالصيغة الدولية مثل 96650555555 وعند الإرسال إلى أكثر من رقم يجب وضع الفاصلة (,) وهي التي عند حرف الواو بين كل رقمين 
										//لا يوجد عدد محدد من الأرقام التي يمكنك الإرسال لها في حال تم الإرسال من خلال بوابة fsockpoen  أو بوابة CURL،
										//ولكن في حال تم الإرسال من خلال بوابة fOpen ، فإنه يمكنك الإرسال إلى 120 رقم فقط في كل عملية إرسال

// $msg = "اهلا وسهلا بك مع mobily.ws";
										/*
										نص الرسالة
										الرساله العربيه  70 حرف
										الرساله الانجليزيه 160 حرف
										في حال ارسال اكثر من رساله عربيه فان الرساله الواحده تحسب 67
										والرساله الانجليزي 153
										*/

$MsgID = rand(1,99999);					//رقم عشوائي يتم إرفاقه مع الإرساليه، في حال الرغبة بإرسال نفس الإرساليه في أقل من ساعه من إرسال الرساله الأولى.
										//موقع موبايلي يمنع تكرار إرسال نفس الرساله خلال ساعه من إرسالها، إلا في حال تم إرسال قيمة مختلفه مع كل إرساليه.
										
$timeSend = 0;							//لتحديد وقت الإرساليه - 0 تعني الإرسال الآن
										//الشكل القياسي للوقت هو hh:mm:ss

$dateSend = 0;							//لتحديد تاريخ الإرساليه - 0 تعني الإرسال الآن
										//الشكل القياسي للتاريخ هو mm:dd:yyyy
										
$deleteKey = 152485;					//يمكنك من خلال هذه القيمة  القيمه يمكنك من خلالها حذف الرساله من خلال بوابة حذف الرسائل.
										//يمكنك تحديد رقم واحد لمجموعه من الإرساليات، بحيث يتم حذفها دفعه واحده.
										
$resultType = 1;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي											

function fastSendSMS($msg, $number)
{
	global $mobile, $password, $sender, $MsgID, $deleteKey;
	return sendSMS($mobile, $password, $number, $sender, $msg, $MsgID, 0, 0, $deleteKey, 1);	
}

?>